# 在这里写上你的代码 :-)
'''
题目003：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
'''
import math


def tm003():
    '''
    【备注,By daode1212,2021-03-25】：因式分解法,计算量小：
        a+100=x*x;a+268=y*y
        y*y-x*x=168=1*2*2*2*3*7==>(y-x)(y+x)
        因为都是整数解,所有的2因数情形是:
        u1=[1,168]
        u2=[2,84]
        u3=[4,42]
        u4=[8,21]
        u1=[3,56]
        u2=[6,28]
        u3=[12,14]
        u4=[24,7]
    '''
    import math
    for ab in [[1,168],[2,84],[4,42],[8,21], [3,56],[6,28],[12,14],[24,7]]:
        #求出二元方程组的解:
        a=(ab[1]-ab[0])/2
        b=(ab[1]+ab[0])/2
        if a%1==0 and b%1==0 :
            print(a*a-100,",",b*b-268)
    '''
    最终会得到4个满足条件的整数：
        1581.0 1581.0
        261.0 261.0
        21.0 21.0
        -99.0 -99.0
    '''

tm003()
