# 在这里写上你的代码 :-)
'''
题目033：按下划线连接[列表`元组`集合`字典]各元素成字符串。
'''
def tm033():
    '''
    【备注】：
    '''
    # 连接列表各元素:
    a = ['1','2','3','4','5','_','H','o','t']
    print('_'.join(a))
    # 连接元组各元素:
    a = ('1','2','3','4','5','_','H','o','t')
    print('_'.join(a))
    # 连接集合各元素:
    a = {'1','2','3','4','5','_','H','o','t'}
    print('_'.join(a))
    # 返回字典"键-值"字符串:
    a = {'1':'fox','2':'hen','3':'cow','4':'bee'}
    print(str(a))
    # 返回字典各键:
    a = {'1':'fox','2':'hen','3':'cow','4':'bee'}
    print('_'.join(a))
    # 返回字典各值:
    a = {'1':'fox','2':'hen','3':'cow','4':'bee'}
    print('_'.join(a.values()))


tm033()
