# 在这里写上你的代码 :-)
'''
题目044：两个3*3的矩阵，实现其对应位置的数据相加，并返回一个新矩阵：
X = [[12,7,3],
    [  4,5,6],
    [  7,8,9]]
Y = [[5,8,1],
    [ 6,7,3],
    [ 4,5,9]]
'''
def tm044():
    '''
    【个人备注】：自己写了一个，但是印象里python是有矩阵计算工具的。
    官网就有人用该工具numpy写了一下，很简洁。
    '''
    x = [[12,7,3],[4,5,6],[7,8,9]]
    y = [[5,8,1],[6,7,3],[4,5,9]]
    z = x[:]
    for i in range(3):
        for j in range(3):
            z[i][j]=x[i][j]+y[i][j]
    print(z)

def tm044_1():
    import numpy #若需要安装模块,使用命令: pip install numpy
    x = numpy.array([[12,7,3],[4,5,6],[7,8,9]])
    y = numpy.array([[5,8,1],[6,7,3],[4,5,9]])
    z = x+y
    print(z)

tm044()
tm044_1()
