# 在这里写上你的代码 :-)
'''
题目100：列表转换为字典。
'''
# 以range来生成下标:
def tm100():

    l = ['ak17','b51','b52','#64']
    d = {}
    for i in range(len(l)):
        d[i]=l[i]
    print(d)
    # 得到：{0: 'ak17', 1: 'b51', 2: 'b52', 3: '#64'}

tm100()

# 下标用独立的变量:
def tm100b():
    l = ['ak17','b51','b52','#64']
    i,d =0, {}
    for m in l:
        d[i]=m
        i+=1
    print(d)
    # 得到：{0: 'ak17', 1: 'b51', 2: 'b52', 3: '#64'}

tm100b()

# 用zip函数更简单:
def tm100c():
    l = ['ak17','b51','b52','#64']
    print(dict(zip(range(4),l)))
    # 得到：{0: 'ak17', 1: 'b51', 2: 'b52', 3: '#64'}

tm100c()

